<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Epic.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Epic</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EpicPrivacyBrowser</string>
		<key>ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.6</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Conditionally replace architecture to match vendor's URL.</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%ARCH%</string>
				<key>find</key>
				<string>x86_64</string>
				<key>replace</key>
				<string></string>
			</dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%output_string%</string>
				<key>find</key>
				<string>arm64</string>
				<key>replace</key>
				<string>arm</string>
			</dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://cdn.epicbrowser.com/mac\d+%output_string%/epic_(?P&lt;version&gt;[\d\.]+)\.dmg)</string>
				<key>url</key>
				<string>https://epicbrowser.com/thank-you</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Epic.app</string>
				<key>requirement</key>
				<string>identifier "com.hiddenreflex.Epic" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "777RMGZA32"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Epic.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
